/************************************************************************/
/* システム名   : RD8001快眠チェッカー									*/
/* ファイル名   : calc_data.h											*/
/* 機能         : 演算共通データ										*/
/* 変更履歴     : 2018.01.15 Axia Soft Design 和田 初版作成				*/
/* 注意事項     : なし													*/
/************************************************************************/
#ifndef		_CALC_DATA_H_		/* 二重定義防止 */
#define		_CALC_DATA_H_

#include "sys.h"

/************************************************************/
/*					マクロ定数定義							*/
/************************************************************/
#define BUF_SIZE		(256)
#define DATA_SIZE_SPO2	(128)
#define DATA_SIZE_APNEA	(200)

/************************************************************/
/* 						型定義								*/
/************************************************************/


/************************************************************/
/*					外部参照宣言							*/
/************************************************************/
extern	double	temp_dbl_buf0[BUF_SIZE];
extern	double	temp_dbl_buf1[BUF_SIZE];
extern	double	temp_dbl_buf2[BUF_SIZE];
extern	double	temp_dbl_buf3[DATA_SIZE_APNEA];

extern	H		temp_int_buf0[BUF_SIZE];
extern	H		temp_int_buf1[BUF_SIZE];
extern	H		temp_int_buf2[BUF_SIZE];

#endif	/*_CALC_DATA_H_*/
/************************************************************/
/* END OF TEXT												*/
/************************************************************/
