/************************************************************************/
/* システム名   : RD8001快眠チェッカー									*/
/* ファイル名   : calc_pulseoximeter.h									*/
/* 機能         : パルスオキシメーター演算処理							*/
/* 変更履歴     : 2018.01.11 Axia Soft Design 和田 初版作成				*/
/* 注意事項     : なし													*/
/************************************************************************/
#ifndef		_CALC_PULSE_OXIMETER_H_		/* 二重定義防止 */
#define		_CALC_PULSE_OXIMETER_H_
#include "sys.h"
/************************************************************/
/*					マクロ定数定義							*/
/************************************************************/


/************************************************************/
/* 						型定義								*/
/************************************************************/


/************************************************************/
/*					外部参照宣言							*/
/************************************************************/
extern void  calculator_pulse_oximeter_red(const signed long* pdata1);
extern void  calculator_pulse_oximeter_inf(const signed long* pdata1);
extern UB    get_sinpak(void);
extern UB    get_spo2(void);

#endif	/*_CALC_PULSE_OXIMETER_H_*/
/************************************************************/
/* END OF TEXT												*/
/************************************************************/
