/********************************************************************************/
/* システム名   : RD8001 快眠チェッカー											*/
/* ファイル名   : eep.h															*/
/* 機能         : EEP(マクロ定義、型定義、関数の外部参照宣言)					*/
/* 変更履歴     : 2018.01.25 Axia Soft Design 西島 稔	初版作成				*/
/* 注意事項     : なし															*/
/********************************************************************************/
#ifndef		_EEP_H_			/* 二重定義防止 */
#define		_TIME_H_

/************************************************************/
/* マクロ													*/
/************************************************************/
#define EEP_DEVICE_ADR			0xA0				// デバイスアドレス
#define EEP_RECORD_SIZE			16					// 1レコードサイズ ※256の約数である必要がある
#define EEP_ADRS_SIZE			2					// 1レコードサイズ

#define EEP_DATA_SIZE_ALL		131072				// EEP全サイズ
#define EEP_DATA_SIZE_PAGE		( 131072 / 2 )		// EEPページサイズ

#define EEP_RECORD_1P_MAX			( EEP_DATA_SIZE_PAGE / EEP_RECORD_SIZE )			// 1レコードサイズ(1ページ目)
#define EEP_RECORD_2P_MAX			( EEP_RECORD_1P_MAX * 2 )							// 1レコードサイズ(2ページ目)


#define I2C_RCV_SND_SIZE	50		//RD8001暫定：サイズ要調整



/************************************************************/
/* 型定義													*/
/************************************************************/


/************************************************************/
/* 外部参照宣言												*/
/************************************************************/
extern void eep_init( void );

extern void R_IICA0_Create(void);
extern void R_IICA0_StopCondition(void);
extern void err_info( int id );


#endif

/************************************************************/
/* END OF TEXT												*/
/************************************************************/

