/************************************************************************/
/* システム名   : RD8001快眠チェッカー									*/
/* ファイル名   : calc_apnea.h											*/
/* 機能         : 無呼吸判定演算処理									*/
/* 変更履歴     : 2017.07.12 Axia Soft Design mmura	初版作成			*/
/* 注意事項     : なし													*/
/************************************************************************/
#ifndef		_CALC_APNEA_H_		/* 二重定義防止 */
#define		_CALC_APNEA_H_

#include "sys.h"

/************************************************************/
/*					マクロ定数定義							*/
/************************************************************/
// 無呼吸判定結果
#define APNEA_NORMAL	0	// 異常なし
#define APNEA_WARN		1	// 無呼吸区間あり
#define APNEA_ERROR		2	// 完全無呼吸
#define APNEA_NONE		3	// 判定エラー

#define APNEA_JUDGE_CNT 1	// 無呼吸判定カウント

/************************************************************/
/* 						型定義								*/
/************************************************************/


/************************************************************/
/*					外部参照宣言							*/
/************************************************************/
extern void	calculator_apnea(const UH *data_apnea, const UH *data_snore);
extern UB	get_state(void);

#endif	/*_CALC_APNEA_H_*/
/************************************************************/
/* END OF TEXT												*/
/************************************************************/
