/************************************************************************/
/* システム名   : 無呼吸判定											*/
/* ファイル名   : movave_param.h										*/
/* 機能         : 無呼吸演算パラメータ									*/
/* 変更履歴     : 2018.05.16 Axia Soft Design mmura	初版作成			*/
/* 注意事項     : なし                                                  */
/************************************************************************/

#ifndef		_MOVAVE_PARAM_H_			/* 二重定義防止 */
#define		_MOVAVE_PARAM_H_

/************************************************************/
/* マクロ													*/
/************************************************************/
// エッジ強調移動平均値の判定上限
#define MAX_EDGE_THRESHOLD			1000

// いびき音の判定下限
#define MIN_SNORE_THRESHOLD			100

// 生の呼吸音の判定下限
#define MIN_BREATH_THRESHOLD		50

// 過去データ参照数
#define PREVIOUS_DATA_NUM		  3

// エッジ強調移動平均の中心の倍率
#define DIAMETER_CENTER			20

// エッジ強調移動平均の隣の倍率
#define DIAMETER_NEXT			 10

// エッジ強調移動平均の端の倍率
#define DIAMETER_END			0.1

#endif

/************************************************************/
/* END OF TEXT												*/
/************************************************************/

