/************************************************************************/
/* システム名   : RD8001快眠チェッカー									*/
/* ファイル名   : calc_data.c											*/
/* 機能         : 演算共通データ										*/
/* 変更履歴     : 2018.01.15 Axia Soft Design 和田 初版作成				*/
/* 注意事項     : なし													*/
/************************************************************************/
#include "calc_data.h"
#include <string.h>

/************************************************************/
/* 定数定義													*/
/************************************************************/


/************************************************************/
/* 変数定義													*/
/************************************************************/
// 演算用データ領域
double	data_apnea_temp_[DATA_SIZE];
double	prms_temp[DATA_SIZE_PRMS];
double	ppoint_temp[DATA_SIZE];
double	data_movave_temp_[DATA_SIZE];

H		thresholds_over_num[DATA_SIZE];
//H		temp_int_buf1[BUF_SIZE];
//H		temp_int_buf2[BUF_SIZE];

/************************************************************************/
/* 関数     : calc_data_init											*/
/* 関数名   : 演算用データ初期化										*/
/* 引数     : なし														*/
/* 戻り値   : なし														*/
/* 変更履歴 : 2019.10.11 oneA 葛原				初版作成				*/
/************************************************************************/
/* 機能 :																*/
/************************************************************************/
/* 注意事項 :															*/
/* なし																	*/
/************************************************************************/
void calc_data_init(void)
{
	memset( data_apnea_temp_, 0, sizeof(data_apnea_temp_));
	memset( prms_temp, 0, sizeof(prms_temp));
	memset( ppoint_temp, 0, sizeof(ppoint_temp));
	memset( data_movave_temp_, 0, sizeof(data_movave_temp_));
	memset( thresholds_over_num, 0, sizeof(thresholds_over_num));
}
/*==============================================================================*/
/* EOF */
