/************************************************************************/
/* システム名   : RD8001快眠チェッカー									*/
/* ファイル名   : calc_data.c											*/
/* 機能         : 演算共通データ										*/
/* 変更履歴     : 2018.01.15 Axia Soft Design 和田 初版作成				*/
/* 注意事項     : なし													*/
/************************************************************************/
#include "calc_data.h"

/************************************************************/
/* 定数定義													*/
/************************************************************/


/************************************************************/
/* 変数定義													*/
/************************************************************/
// 演算用データ領域
double	data_apnea_temp_[DATA_SIZE];
double	prms_temp[DATA_SIZE_PRMS];
double	ppoint_temp[DATA_SIZE];
double	data_movave_temp_[DATA_SIZE];

H		thresholds_over_num[DATA_SIZE];
//H		temp_int_buf1[BUF_SIZE];
//H		temp_int_buf2[BUF_SIZE];

/*==============================================================================*/
/* EOF */
