/************************************************************************/
/* システム名   : RD8001快眠チェッカー									*/
/* ファイル名   : calc_data.c											*/
/* 機能         : 演算共通データ										*/
/* 変更履歴     : 2018.01.15 Axia Soft Design 和田 初版作成				*/
/* 注意事項     : なし													*/
/************************************************************************/
#include "calc_data.h"

/************************************************************/
/* 定数定義													*/
/************************************************************/


/************************************************************/
/* 変数定義													*/
/************************************************************/
// 演算用データ領域
double	temp_dbl_buf0[BUF_SIZE];
double	temp_dbl_buf1[BUF_SIZE];
double	temp_dbl_buf2[BUF_SIZE];
double	temp_dbl_buf3[DATA_SIZE_APNEA];

H		temp_int_buf0[BUF_SIZE];
H		temp_int_buf1[BUF_SIZE];
H		temp_int_buf2[BUF_SIZE];

/*==============================================================================*/
/* EOF */
