/************************************************************************/
/* システム名   : 脈拍判定												*/
/* ファイル名   : pulse_param.h											*/
/* 機能         : 無呼吸演算パラメータ									*/
/* 変更履歴     : 2018.05.21 Axia Soft Design mmura	初版作成			*/
/* 注意事項     : なし                                                  */
/************************************************************************/

#ifndef		_PULSE_PARAM_H_			/* 二重定義防止 */
#define		__PULSE_PARAM_H_

/************************************************************/
/* マクロ													*/
/************************************************************/

// フィルタ処理
// 9Hz - 10.1Hz のみを通過させる
// サンプリング周期が20Hzであるため、1 / (128 / 20) = 0.15625Hz
// 6 * 0.15625 ≒ 9Hz
#define _PULSE_PARAM_START			6
// 65 * 0.15625 ≒ 10.1Hz
#define _PULSE_PARAM_END			65

// 心拍数演算向け時間係数
// 6.4 / (128 + _PULSE_PARAM_END)
#define _PULSE_PARAM_SNPK_COEF		0.03316f

// SPO2演算
#define _PULSE_PARAM_EO1			0.8973f
#define _PULSE_PARAM_EO2			0.3346f
#define _PULSE_PARAM_ED1			0.8146f
#define _PULSE_PARAM_ED2			3.4408f

#endif

/************************************************************/
/* END OF TEXT												*/
/************************************************************/

