/************************************************************************/
/* システム名   : RD8001 快眠チェッカー									*/
/* ファイル名   : cpu_com.c												*/
/* 機能         : CPU間通信ミドル										*/
/* 変更履歴     : 2018.04.10 Axia Soft Design 西島		初版作成		*/
/* 注意事項     : なし													*/
/************************************************************************/
/********************/
/*     include      */
/********************/
#include	"header.h"		//ユーザー定義

#include	"uart.h"


/************************************************************/
/* プロトタイプ宣言											*/
/************************************************************/


/********************/
/*     内部変数     */
/********************/
// =============================
// ドライバ用定義
// =============================
#define	DRV_UART0_RCV_RING_LENGTH				CPU_COM_BUF_SIZE_MAX			/* リングバッファ長(1メッセージ分＋１) ※＋１の理由はリングバッファの注意事項参照 */
//#define	DRV_UART0_SND_RING_LENGTH				CPU_COM_BUF_SIZE_MAX		/* リングバッファ長(1メッセージ分＋１) ※＋１の理由はリングバッファの注意事項参照 */


#define			SERIAL_DRV_RCV_SIZE				1				//受信DMA通信サイズ:データ長が固定で無い事から1バイトで受信する ※負荷確認済み(2018.09.06)
uint8_t			serial_drv_rcv[SERIAL_DRV_RCV_SIZE];

//UB drv_uart0_send_buf[DRV_UART0_SND_RING_LENGTH];				/* 送信バッファ(リング用) */// 送信はDMA転送で一括送信する為にリングバッファは不要
UB drv_uart0_rcv_buf[DRV_UART0_RCV_RING_LENGTH];				/* 受信バッファ(リング用) */
RING_BUF drv_uart0_send_ring;									/* 送信リングバッファ用コントローラ */
RING_BUF drv_uart0_rcv_ring;									/* 受信リングバッファ用コントローラ */


/********************/
/*   テーブル定義   */
/********************/
/* コマンドテーブル ※マスター専用 */
/* タイプを変更する事で受信専用にも対応 */
STATIC const T_CPU_COM_CMD_INFO s_tbl_cmd_info[CPU_COM_CMD_MAX] = {
	/*コマンド*/ /*タイプ*/					/*リトライ(初送含む)*//*リトライ間隔[10ms] */ /*連送回数*/
	{	0x00,	CPU_COM_CMD_TYPE_ONESHOT_SEND,		0,				0,						0	},	/* コマンド無し				*/
	{	0xE0,	CPU_COM_CMD_TYPE_RETRY,				3,				10,						0	},	/* ステータス要求			*/
	{	0xA0,	CPU_COM_CMD_TYPE_ONESHOT_RCV,		0,				0,						0	},	/* センサーデータ更新		*/
	{	0xA1,	CPU_COM_CMD_TYPE_ONESHOT_SEND,		0,				0,						0	},	/* センシング指示			*/
	{	0xB0,	CPU_COM_CMD_TYPE_RETRY,				3,				10,						0	},	/* 状態変更(G1D)			*/
	{	0xF0,	CPU_COM_CMD_TYPE_ONESHOT_SEND,		0,				0,						0	},	/* PCログ送信(内部コマンド)	*/
	{	0xB1,	CPU_COM_CMD_TYPE_RETRY,				3,				10,						0	},	/* 日時設定					*/
	{	0xD5,	CPU_COM_CMD_TYPE_RETRY,				3,				10,						0	},	/* プログラム転送準備		*/
	{	0xD2,	CPU_COM_CMD_TYPE_RETRY,				3,				10,						0	},	/* プログラム転送開始		*/
	{	0xD4,	CPU_COM_CMD_TYPE_RETRY,				3,				10,						0	},	/* プログラム転送消去		*/
	{	0xD0,	CPU_COM_CMD_TYPE_RETRY,				3,				10,						0	},	/* プログラム転送データ		*/
	{	0xD1,	CPU_COM_CMD_TYPE_RETRY,				3,				10,						0	},	/* プログラム転送結果		*/
	{	0xD3,	CPU_COM_CMD_TYPE_RETRY,				10,				10,						0	},	/* プログラム転送確認		*/
	{	0xB2,	CPU_COM_CMD_TYPE_RETRY,				3,				10,						0	},	/* 表示指示					*/
	{	0xB3,	CPU_COM_CMD_TYPE_RETRY,				3,				10,						0	},	/* バージョン				*/
};

/************************************************************************/
/* 関数     : cpu_com_init												*/
/* 関数名   : 初期化処理(プラットフォーム/ユーザー)						*/
/* 引数     : なし														*/
/* 戻り値   : なし														*/
/* 変更履歴 : 2018.09.07 Axia Soft Design 西島		初版作成			*/
/************************************************************************/
/* 機能 : 初期化処理(プラットフォーム/ユーザー)							*/
/************************************************************************/
/* 注意事項 : なし														*/
/************************************************************************/
void cpu_com_init( void )
{
}

/************************************************************************/
/* 関数     : cpu_com_read_comp											*/
/* 関数名   : 読み出し完了(プラットフォーム)							*/
/* 引数     : なし														*/
/* 戻り値   : なし														*/
/* 変更履歴 : 2018.09.07 Axia Soft Design 西島		初版作成			*/
/************************************************************************/
/* 機能 : 読み出し完了(プラットフォーム)								*/
/************************************************************************/
/* 注意事項 : なし														*/
/************************************************************************/
void cpu_com_read_comp( void )
{
}

/************************************************************************/
/* 関数     : cpu_com_write_comp										*/
/* 関数名   : 書き込み完了(プラットフォーム)							*/
/* 引数     : なし														*/
/* 戻り値   : なし														*/
/* 変更履歴 : 2018.09.07 Axia Soft Design 西島		初版作成			*/
/************************************************************************/
/* 機能 : 書き込み完了(プラットフォーム)								*/
/************************************************************************/
/* 注意事項 : なし														*/
/************************************************************************/
void cpu_com_write_comp( void )
{
}

/************************************************************************/
/* 関数     : cpu_com_error_comp										*/
/* 関数名   : 異常発生(プラットフォーム)								*/
/* 引数     : なし														*/
/* 戻り値   : なし														*/
/* 変更履歴 : 2018.09.07 Axia Soft Design 西島		初版作成			*/
/************************************************************************/
/* 機能 : 異常発生(プラットフォーム)									*/
/************************************************************************/
/* 注意事項 : なし														*/
/************************************************************************/
void cpu_com_error_comp( void )
{
}


/************************************************************************/
/* ユーザーアプリ														*/
/************************************************************************/

/************************************************************************/
/* 関数     : cpu_com_proc												*/
/* 関数名   : CPU間通信周期処理											*/
/* 引数     : なし														*/
/* 戻り値   : なし														*/
/* 変更履歴 : 2018.05.13  Axia Soft Design 西島		初版作成			*/
/************************************************************************/
/* 機能 : 周期処理														*/
/************************************************************************/
/* 注意事項 :なし														*/
/************************************************************************/
void cpu_com_proc(void)
{
}

/************************************************************************/
/* 関数     : cpu_com_get_can_sleep										*/
/* 関数名   : スリープ可能状態取得										*/
/* 引数     : なし														*/
/* 戻り値   : なし														*/
/* 変更履歴 : 2018.09.07 Axia Soft Design 西島		初版作成			*/
/************************************************************************/
/* 機能 : スリープ可能状態取得											*/
/************************************************************************/
/* 注意事項 : なし														*/
/************************************************************************/
UB cpu_com_get_can_sleep( void )
{
	return OFF;
}

/************************************************************************/
/* 関数     : drv_cpu_com_set_send_status								*/
/* 関数名   : CPU間通信送信状態セット									*/
/* 引数     : UB status : 更新する状態									*/
/* 戻り値   : なし														*/
/* 変更履歴 : 2018.04.25 Axia Soft Design 西島 稔	初版作成			*/
/************************************************************************/
/* 機能 :																*/
/* CPU間通信の送信状態を更新する										*/
/************************************************************************/
/* 注意事項 :															*/
/* 未使用関数(2016.02.24)プロトコル変更により上位から設定されなくなった */
/************************************************************************/
void drv_cpu_com_set_send_status( UB status )
{
}

/************************************************************************/
/* 関数     : drv_cpu_com_get_send_status								*/
/* 関数名   : CPU間通信送信状態取得										*/
/* 引数     : UB *status : 送信状態										*/
/* 戻り値   : なし														*/
/* 変更履歴 : 2018.04.25 Axia Soft Design 西島 稔	初版作成			*/
/************************************************************************/
/* 機能 :																*/
/* CPU間通信の送信状態を取得する										*/
/************************************************************************/
/* 注意事項 :															*/
/* なし																	*/
/************************************************************************/
void drv_cpu_com_get_send_status( UB *status )
{
}


/************************************************************************/
/* 関数     : drv_uart0_init											*/
/* 関数名   : UART0初期化処理											*/
/* 引数     : なし														*/
/* 戻り値   : なし														*/
/* 変更履歴 : 2018.01.25 Axia Soft Design 西島 稔	初版作成			*/
/************************************************************************/
/* 機能 :																*/
/* UART0の初期化処理													*/
/************************************************************************/
/* 注意事項 :															*/
/* なし																	*/
/************************************************************************/
void drv_uart0_data_init( void )
{
}

/************************************************************************/
/* 関数     : drv_uart0_get_rcv_ring									*/
/* 関数名   : 受信リングバッファポインタ取得							*/
/* 引数     : なし														*/
/* 戻り値   : 受信リングバッファのポインタ								*/
/* 変更履歴 : 2018.01.25 Axia Soft Design 西島 稔	初版作成			*/
/************************************************************************/
/* 機能 :																*/
/* リングバッファのポインタを返す										*/
/************************************************************************/
/* 注意事項 :															*/
/* なし																	*/
/************************************************************************/
RING_BUF* drv_uart0_get_rcv_ring( void )
{
	return NULL;
}

