/********************************************************************************/
/* システム名   : RD8001 快眠チェッカー											*/
/* ファイル名   : i2c.h															*/
/* 機能         : I2C(マクロ定義、型定義、関数の外部参照宣言)					*/
/* 変更履歴     : 2019.05.13 Axia Soft Design mmura		初版作成				*/
/* 注意事項     : なし															*/
/********************************************************************************/
#ifndef		_I2C_H_			/* 二重定義防止 */
#define		_I2C_H_

/************************************************************/
/* マクロ													*/
/************************************************************/
#define	I2C_WAIT						255			// スタートコンディション待ち ※数百us程度なので最大値を設定しておく


/************************************************************/
/* 型定義													*/
/************************************************************/


/************************************************************/
/* 外部参照宣言												*/
/************************************************************/
extern void i2c_init( void );

extern void R_IICA0_Create(void);
extern void R_IICA0_StopCondition(void);
extern void i2c_set_snd_flg( UB data );
extern void i2c_set_rcv_flg( UB data );
extern void i2c_set_err_flg( UB data );

// アプリに提供するAPI
void i2c_write_sub( UB device_adrs, UB* wr_data, UH len, UB wait_flg );
void i2c_read_sub( UB device_adrs, UH read_adrs, UB* read_data, UH len );
void i2c_read_sub_for_acl( UB device_adrs, UH read_adrs, UB* read_data, UH len );


#endif

/************************************************************/
/* END OF TEXT												*/
/************************************************************/

