/********************************************************************************/
/* システム名   : RD8001 快眠チェッカー											*/
/* ファイル名   : eep.c															*/
/* 機能         : EEP（関数,RAM,ROM定義）										*/
/* 変更履歴     : 2018.01.25 Axia Soft Design 西島 稔	初版作成				*/
/* 注意事項     : なし															*/
/********************************************************************************/

/********************/
/*     include      */
/********************/
#include	"header.h"		//ユーザー定義


/************************************************************/
/* プロトタイプ宣言											*/
/************************************************************/
void wait_ms( int ms );

/********************/
/*     内部変数     */
/********************/
// I2Cドライバのフラグ ※i2cドライバで設定される
STATIC UB i2c_snd_flg;			//送信フラグ(I2C)
STATIC UB i2c_rcv_flg;			//受信フラグ(I2C)
// RD8001暫定：EEPの異常時の動作が仕様上未定義
STATIC UB i2c_err_flg;			//エラーフラグ(I2C)


/************************************************************/
/* ＲＯＭ定義												*/
/************************************************************/

/************************************************************************/
/* 関数     : i2c_init													*/
/* 関数名   : I2C初期化処理												*/
/* 引数     : なし														*/
/* 戻り値   : なし														*/
/* 変更履歴 : 2019.05.13 Axia Soft Design mmura		初版作成			*/
/************************************************************************/
/* 機能 : I2C初期化処理													*/
/************************************************************************/
/* 注意事項 : なし														*/
/************************************************************************/
void i2c_init( void )
{
	//データ初期化
	i2c_snd_flg = OFF;
	i2c_rcv_flg = OFF;
	i2c_err_flg = OFF;
	
	// I2C初期化
	R_IICA0_Create();
}


/************************************************************************/
/* 関数     : i2c_write_sub												*/
/* 関数名   : I2C書き込みサブ											*/
/* 引数     : device_adrs	デバイスアドレス							*/
/*          : wr_data		書き込みデータ								*/
/*          : len			データ長									*/
/*          : wait_flg		書き込み待ちフラグ							*/
/* 戻り値   : なし														*/
/* 変更履歴 : 2018.01.25 Axia Soft Design 西島 稔	初版作成			*/
/************************************************************************/
/* 機能 : I2C書き込みサブ												*/
/************************************************************************/
/* 注意事項 : なし														*/
/************************************************************************/
void i2c_write_sub( UB device_adrs, UB* wr_data, UH len, UB wait_flg )
{
	UW lcok_cnt = 0;

	if( 0 != R_IICA0_Master_Send( device_adrs, wr_data, len, I2C_WAIT)){
		err_info(ERR_ID_I2C);
		i2c_err_flg = ON;
	}else{
		while(1){
			if( OFF == i2c_snd_flg ){
				// 送信完了
				break;
			}
			if( lcok_cnt++ >= EEP_I2C_LOCK_ERR_VAL ){
				// 異常時
				err_info(ERR_ID_I2C);
				i2c_err_flg = ON;
				break;
			}
		}
		if( OFF == i2c_err_flg ){
			R_IICA0_StopCondition();		//　異常発生時は予期せぬ書き込みを防止する為にストップコンディション発行しない
		}
	}
	
	while(0U == SPD0){}

	if( wait_flg == ON ){
		wait_ms(5);			/* Write Cycle Time */
	}
	
	if( ON == i2c_err_flg ){
		i2c_err_flg = OFF;
		R_IICA0_Create();		// I2C初期化
	}
}

/************************************************************************/
/* 関数     : i2c_read_sub												*/
/* 関数名   : I2C読み出しサブ											*/
/* 引数     : device_adrs	デバイスアドレス							*/
/*          : read_adrs		読み出しアドレス							*/
/*          : read_data		読み出しデータ								*/
/*          : len			データ長									*/
/* 戻り値   : なし														*/
/* 変更履歴 : 2018.01.25 Axia Soft Design 西島 稔	初版作成			*/
/************************************************************************/
/* 機能 : I2C読み出しサブ												*/
/************************************************************************/
/* 注意事項 : なし														*/
/************************************************************************/
void i2c_read_sub( UB device_adrs, UH read_adrs, UB* read_data, UH len )
{
	UB adrs[2];
	UB adrs_size = 0;
	UW lcok_cnt = 0;

#if FUNC_DEBUG_LOG == ON
	adrs[0] = (UB)( read_adrs & 0x00ff );			//アドレス下位
	adrs_size  = 1;
#else
	adrs[0] = (UB)(( read_adrs >> 8 ) & 0xff );			//アドレス上位
	adrs[1] = (UB)( read_adrs & 0x00ff );			//アドレス下位
	adrs_size  = 2;
#endif
	if( 0 != R_IICA0_Master_Send( device_adrs, &adrs[0], adrs_size, I2C_WAIT )){
		err_info(ERR_ID_EEP);
	}else{
		while(1){
			if( OFF == i2c_snd_flg ){
				// 送信完了
				break;
			}
			if( lcok_cnt++ >= EEP_I2C_LOCK_ERR_VAL ){
				// 異常時
				err_info(ERR_ID_EEP);
				i2c_err_flg = ON;
				break;
			}
		}
	}
	//バス開放
	R_IICA0_Stop();
	R_IICA0_Create();
	
	if( 0 != R_IICA0_Master_Receive(device_adrs, read_data, len, I2C_WAIT)){
		err_info(ERR_ID_EEP);
	}else{
		while(1){
			if( OFF == i2c_rcv_flg ){
				// 受信完了
				break;
			}
			if( lcok_cnt++ >= EEP_I2C_LOCK_ERR_VAL ){
				// 異常時
				err_info(ERR_ID_EEP);
				i2c_err_flg = ON;
				break;
			}
		}
		if( OFF == i2c_err_flg ){
			R_IICA0_StopCondition();		//　異常発生時は予期せぬ書き込みを防止する為にストップコンディション発行しない
		}
	}
	while(0U == SPD0){}
	
	if( ON == i2c_err_flg ){
		i2c_err_flg = OFF;
		R_IICA0_Create();		// I2C初期化
	}
}


/************************************************************************/
/* 関数     : i2c_set_snd_flg											*/
/* 関数名   : 送信フラグ設定											*/
/* 引数     : なし														*/
/* 戻り値   : なし														*/
/* 変更履歴 : 2018.09.07 Axia Soft Design 西島 稔	初版作成			*/
/************************************************************************/
/* 機能 : 送信フラグ設定												*/
/************************************************************************/
/* 注意事項 : なし														*/
/************************************************************************/
void i2c_set_snd_flg( UB data )
{
	i2c_snd_flg = data;
}

/************************************************************************/
/* 関数     : i2c_set_snd_flg											*/
/* 関数名   : 受信フラグ設定											*/
/* 引数     : なし														*/
/* 戻り値   : なし														*/
/* 変更履歴 : 2018.09.07 Axia Soft Design 西島 稔	初版作成			*/
/************************************************************************/
/* 機能 : 受信フラグ設定												*/
/************************************************************************/
/* 注意事項 : なし														*/
/************************************************************************/
void i2c_set_rcv_flg( UB data )
{
	i2c_rcv_flg = data;
}

/************************************************************************/
/* 関数     : i2c_set_err_flg											*/
/* 関数名   : エラーフラグ設定											*/
/* 引数     : なし														*/
/* 戻り値   : なし														*/
/* 変更履歴 : 2018.09.07 Axia Soft Design 西島 稔	初版作成			*/
/************************************************************************/
/* 機能 : エラーフラグ設定												*/
/************************************************************************/
/* 注意事項 : なし														*/
/************************************************************************/
void i2c_set_err_flg( UB data )
{
	i2c_err_flg = data;
}

/************************************************************/
/* END OF TEXT												*/
/************************************************************/
