/********************************************************************************/
/* システム名   : RD8001 快眠チェッカー											*/
/* ファイル名   : vibration.c													*/
/* 機能         : バイブレーション制御											*/
/* 変更履歴		: 2019.07.24 oneA 葛原 弘安	初版作成							*/
/* 注意事項     : なし															*/
/********************************************************************************/

#include	"header.h"				//ユーザー定義
#include	"vibration.h"

// グローバル変数
B			vib_orbit = 0;
VIB_MODE	vib_mode = VIB_MODE_MAX;

// プロトタイプ宣言
STATIC void vib_on(void);
STATIC void vib_off(void);
STATIC void vib_mode_weak(UH vib_timer);
STATIC void vib_mode_during(UH vib_timer);
STATIC void vib_mode_strength(UH vib_timer);
STATIC void vib_mode_standby(UH vib_timer);
STATIC void vib_mode_sensing(UH vib_timer);

/************************************************************************/
/* 関数     : vib_start													*/
/* 関数名   : バイブレーション開始										*/
/* 引数     : vib_timer:バイブタイマー									*/
/* 戻り値   : なし														*/
/* 変更履歴 : 2019.07.24 oneA 葛原 弘安	初版作成						*/
/************************************************************************/
/* 機能 : 																*/
/************************************************************************/
/* 注意事項 : なし														*/
/************************************************************************/
void vib_start(UH vib_timer)
{ // メインループ処理内でコール
	if(vib_orbit < VIB_ORBIT)
	{
		switch (vib_mode)
		{
			case VIB_MODE_ON:	// ON(単純動作)
				vib_on();
				break;
			case VIB_MODE_OFF:	// OFF(単純動作)
				vib_off();
				break;
			case VIB_MODE_WEAK:	// 弱
				vib_mode_weak(vib_timer);
				break;
			case VIB_MODE_DURING: // 中
				vib_mode_during(vib_timer);
				break;
			case VIB_MODE_STRENGTH: // 強
				vib_mode_strength(vib_timer);
				break;
			case VIB_MODE_STANDBY: // 待機モード移行時
				vib_mode_standby(vib_timer);
				break;
			case VIB_MODE_SENSING: // センシングモード移行時
				vib_mode_sensing(vib_timer);
				break;
			default:
				break;
		}
	}
}

/************************************************************************/
/* 関数     : set_vib													*/
/* 関数名   : バイブレーション設定										*/
/* 引数     : mode:バイブパターン										*/
/* 戻り値   : なし														*/
/* 変更履歴 : 2019.07.24 oneA 葛原 弘安	初版作成						*/
/************************************************************************/
/* 機能 : 																*/
/************************************************************************/
/* 注意事項 : なし														*/
/************************************************************************/
void set_vib(VIB_MODE mode)
{ //動かしたいタイミングでコール
	// ON
	// 10msecタイマーリセット
	reset_vib_timer();
	
	// 周回リセット
	vib_orbit = 0;
	
	// パターン
	vib_mode = mode;
}

/************************************************************************/
/* 関数     : vib_on													*/
/* 関数名   : バイブレーションON										*/
/* 引数     : なし														*/
/* 戻り値   : なし														*/
/* 変更履歴 : 2019.07.24 oneA 葛原 弘安	初版作成						*/
/************************************************************************/
/* 機能 : 																*/
/************************************************************************/
/* 注意事項 : なし														*/
/************************************************************************/
STATIC void vib_on(void)
{ 
	// ON
	VIB_CTL = 1;
	VIB_ENA = 1;
}

/************************************************************************/
/* 関数     : vib_off													*/
/* 関数名   : バイブレーションOFF										*/
/* 引数     : なし														*/
/* 戻り値   : なし														*/
/* 変更履歴 : 2019.07.24 oneA 葛原 弘安	初版作成						*/
/************************************************************************/
/* 機能 : 																*/
/************************************************************************/
/* 注意事項 : なし														*/
/************************************************************************/
STATIC void vib_off(void)
{ 
	// OFF
	VIB_CTL = 0;
	VIB_ENA = 0;
}

/************************************************************************/
/* 関数     : vib_mode_weak												*/
/* 関数名   : バイブレーション弱制御									*/
/* 引数     : vib_timer:バイブタイマー									*/
/* 戻り値   : なし														*/
/* 変更履歴 : 2019.07.24 oneA 葛原 弘安	初版作成						*/
/************************************************************************/
/* 機能 : 																*/
/************************************************************************/
/* 注意事項 : なし														*/
/************************************************************************/
STATIC void vib_mode_weak(UH vib_timer)
{
	if(	20 <= vib_timer )
	{
//		VIB_CTL = 0; // 保険
//		VIB_ENA = 0;
		vib_orbit += 1;
		reset_vib_timer();
	} if( 5 <= vib_timer )
	{
		VIB_ENA = 0;
	} if( 3 <= vib_timer )
	{
		VIB_CTL = 0;
	} else
	{
		VIB_CTL = 1;
		VIB_ENA = 1;
	}
}

/************************************************************************/
/* 関数     : vib_mode_during											*/
/* 関数名   : バイブレーション中制御									*/
/* 引数     : vib_timer:バイブタイマー									*/
/* 戻り値   : なし														*/
/* 変更履歴 : 2019.07.24 oneA 葛原 弘安	初版作成						*/
/************************************************************************/
/* 機能 : 																*/
/************************************************************************/
/* 注意事項 : なし														*/
/************************************************************************/
STATIC void vib_mode_during(UH vib_timer)
{
	if(	20 <= vib_timer )
	{
//		VIB_CTL = 0; // 保険
//		VIB_ENA = 0;
		vib_orbit += 1;
		reset_vib_timer();
	} if( 13 <= vib_timer )
	{
		VIB_ENA = 0;
	} if( 11 <= vib_timer )
	{
		VIB_CTL = 0;
	} else
	{
		VIB_CTL = 1;
		VIB_ENA = 1;
	}	
}

/************************************************************************/
/* 関数     : vib_mode_strength											*/
/* 関数名   : バイブレーション強制御									*/
/* 引数     : vib_timer:バイブタイマー									*/
/* 戻り値   : なし														*/
/* 変更履歴 : 2019.07.24 oneA 葛原 弘安	初版作成						*/
/************************************************************************/
/* 機能 : 																*/
/************************************************************************/
/* 注意事項 : なし														*/
/************************************************************************/
STATIC void vib_mode_strength(UH vib_timer)
{
	if(	20 <= vib_timer )
	{
//		VIB_CTL = 0; // 保険
//		VIB_ENA = 0;
		vib_orbit += 1;
		reset_vib_timer();
	} if( 19 <= vib_timer )
	{
		VIB_ENA = 0;
	} if( 17 <= vib_timer )
	{
		VIB_CTL = 0;
	} else
	{
		VIB_CTL = 1;
		VIB_ENA = 1;
	}	
}

/************************************************************************/
/* 関数     : vib_mode_standby											*/
/* 関数名   : バイブレーション待機モード移行時制御						*/
/* 引数     : vib_timer:バイブタイマー									*/
/* 戻り値   : なし														*/
/* 変更履歴 : 2019.07.24 oneA 葛原 弘安	初版作成						*/
/************************************************************************/
/* 機能 : 																*/
/************************************************************************/
/* 注意事項 : なし														*/
/************************************************************************/
STATIC void vib_mode_standby(UH vib_timer)
{
	if(	80 <= vib_timer )
	{
		VIB_CTL = 0;
		VIB_ENA = 0;
		vib_orbit = 3;
		reset_vib_timer();
	} else
	{
		VIB_CTL = 1;
		VIB_ENA = 1;
	}	
}

/************************************************************************/
/* 関数     : vib_mode_sensing											*/
/* 関数名   : バイブレーションセンシングモード移行時制御				*/
/* 引数     : vib_timer:バイブタイマー									*/
/* 戻り値   : なし														*/
/* 変更履歴 : 2019.07.24 oneA 葛原 弘安	初版作成						*/
/************************************************************************/
/* 機能 : 																*/
/************************************************************************/
/* 注意事項 : なし														*/
/************************************************************************/
STATIC void vib_mode_sensing(UH vib_timer)
{
	if(	10 <= vib_timer )
	{
		VIB_CTL = 0;
		VIB_ENA = 0;
		vib_orbit = 3;
		reset_vib_timer();
	} else
	{
		VIB_CTL = 1;
		VIB_ENA = 1;
	}
}
